/* First thing first: Konpu ASSUMEs C11 or later */
#ifndef KONPU_C_H_
#  if !defined(__STDC_VERSION__) || (__STDC_VERSION__ < 201112L)
#     error "Konpu requires a compiler conforming to C11 (or later) standard."
#  endif
#endif

// - Check for standard C11 (or later) compliance
// - Check for "common" assumptions that Konpu relies on
//   Hint: `grep` Konpu's sources for the word "ASSUMEs" to list them all.
// - Include "config.h"
// - Include the following "free-standing" C headers:
//   <float.h>, <limits.h>, <stdarg.h>, <stddef.h>, <stdint.h>
// - Define "polyfills" (or alternatives) to bring many C23 functionalities:
//   * unreachable() macro
//   * static_assert(...) keyword (with one or two argument(s))
//   * alignas/alignof keywords (<stdalign.h> in C11/17)
//   * bool/true/false type/keywords (<stdbool.h> in C11/17)
//   * bits functionalities like C23 (actually defined in the file "bits.h")
//     - macros like in the <stdbit.h> header
//     - the BITS(...) macro to write binary literals
//   * TODO(review)   UTIL_VA_OPT_COMMA(...) as a functional equivalent to __VA_OPT__(,)
//   * misc...
// - Declare (or even implement) some functionalities similar to
//   (non-freestanding) C headers:
//   * assert(...) similar to <assert.h>
//   * some of the mem* functions similar to <string.h>
// - Common extensions, such as:
//   * macros UTIL_OVERLOAD for variadic overloading based on number of args.

#  undef  static_assert // <-- undef as this has been defined by <assert.h>
#  define static_assert(...)   UTIL_OVERLOAD(PRIVATE_STATIC_ASSERT, __VA_ARGS__)
#     define PRIVATE_STATIC_ASSERT_2_(condition, string_literal)               \
         _Static_assert((condition), string_literal)
#     define PRIVATE_STATIC_ASSERT_1_(condition)                               \
         _Static_assert((condition), UTIL_STRINGIFY(__LINE__))
#endif

//------------------------------------------------------------------------------
// <limits.h> - Range of integer types
//
// see: https://en.cppreference.com/w/c/header/limits.html
//------------------------------------------------------------------------------
// Include the header as it is fully freestanding.
#include <limits.h>
#if CHAR_BIT != 8  // Konpu ASSUMEs 8-bits bytes (and so do POSIX and Windows)
#  error "byte width is not 8-bits"
#endif
// Return the number of bits for an integer of the form: 2^n - 1 (with n < 2040)
#define UTIL_COUNT_BITS_OF_2N1_(x) \
   ((x)/((x)%255+1) / 255%255*8 + 7-86/((x)%255+12))
   // Used to pass the MAX of an integer type and get that type's width as
   // a macro constant. This trick is from:
   // https://stackoverflow.com/questions/3957252/is-there-any-way-to-compute-the-width-of-an-integer-type-at-compile-time
   // The credit for the macros goes to Hallvard B. Furuseth who had posted them
   // (under the name IMAX_BITS) in the comp.lang.c Usenet newsgroup,
   // see: https://groups.google.com/g/comp.lang.c/c/NfedEFBFJ0k
   // and: https://groups.google.com/group/comp.lang.c/msg/e998153ef07ff04b
   // also, see explanations at:
   // https://web.archive.org/web/20150403064546/http://coding.derkeiler.com/Archive/C_CPP/comp.lang.c/2009-01/msg02242.html
// "Polyfill" definitions for C prior to C23:
#if __STDC_VERSION__ < 202311L
#  define CHAR_WIDTH         CHAR_BIT
#  define UCHAR_WIDTH        CHAR_BIT
#  define SCHAR_WIDTH        CHAR_BIT
#  define USHRT_WIDTH        UTIL_COUNT_BITS_OF_2N1_(USHRT_MAX)
#  define UINT_WIDTH         UTIL_COUNT_BITS_OF_2N1_(UINT_MAX)
#  define ULONG_WIDTH        UTIL_COUNT_BITS_OF_2N1_(ULONG_MAX)
#  define ULLONG_WIDTH       UTIL_COUNT_BITS_OF_2N1_(ULLONG_MAX)
#  define SHRT_WIDTH         USHRT_WIDTH
#  define INT_WIDTH          UINT_WIDTH
#  define LONG_WIDTH         ULONG_WIDTH
#  define LLONG_WIDTH        ULLONG_WIDTH
   // (note: C23 also has BOOL_WIDTH [and a few more])
#endif
// bit-precise integers (may work starting from C23)
#ifndef   BITINT_MAXWIDTH     // Test BITINT_MAXWIDTH >= n to know if the type
#  define BITINT_MAXWIDTH  0  // _BitInt(n) can be used.
#endif

//------------------------------------------------------------------------------
// <stdint.h> - Fixed-width integer types
//
// see: https://en.cppreference.com/w/c/header/stdint.html
//------------------------------------------------------------------------------
// Include the header as it is fully freestanding.
#include <stdint.h>
// Konpu ASSUMEs the existence of [u]int<8|16|32|64>_t
static_assert(sizeof( int_least8_t ) == 1);
static_assert(sizeof(uint_least8_t ) == 1);
static_assert(sizeof( int_least16_t) == 2);
static_assert(sizeof(uint_least16_t) == 2);
static_assert(sizeof( int_least32_t) == 4);
static_assert(sizeof(uint_least32_t) == 4);
static_assert(sizeof( int_least64_t) == 8);
static_assert(sizeof(uint_least64_t) == 8);
// "Polyfill" definitions for C prior to C23
#if __STDC_VERSION__ < 202311L
#  define INT8_WIDTH            8
#  define INT16_WIDTH          16
#  define INT32_WIDTH          32
#  define INT64_WIDTH          64
#  define INT_LEAST8_WIDTH      8
#  define INT_LEAST16_WIDTH    16
#  define INT_LEAST32_WIDTH    32
#  define INT_LEAST64_WIDTH    64
#  define INT_FAST8_WIDTH      UTIL_COUNT_BITS_OF_2N1_(INT_FAST8_MAX)
#  define INT_FAST16_WIDTH     UTIL_COUNT_BITS_OF_2N1_(INT_FAST16_MAX)
#  define INT_FAST32_WIDTH     UTIL_COUNT_BITS_OF_2N1_(INT_FAST32_MAX)
#  define INT_FAST64_WIDTH     UTIL_COUNT_BITS_OF_2N1_(INT_FAST64_MAX)
#  define UINT8_WIDTH           8
#  define UINT16_WIDTH         16
#  define UINT32_WIDTH         32
#  define UINT64_WIDTH         64
#  define UINT_LEAST8_WIDTH     8
#  define UINT_LEAST16_WIDTH   16
#  define UINT_LEAST32_WIDTH   32
#  define UINT_LEAST64_WIDTH   64
